---
type: SpatialElementTag
namespace: Autodesk.Revit.DB
version: 2024
members: 13
tags: [revit-api, class]
---

# SpatialElementTag

`Autodesk.Revit.DB.SpatialElementTag` · Revit 2024 · 13 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | HasElbow | — | `public bool HasElbow { get ; }` |
| Property | HasLeader | — | `public bool HasLeader { get ; set ; }` |
| Property | IsOrphaned | 2017 | `public bool IsOrphaned { get ; }` |
| Property | IsTaggingLink | 2017 | `public bool IsTaggingLink { get ; }` |
| Property | LeaderElbow | 2017 | `public XYZ LeaderElbow { get ; set ; }` |
| Property | LeaderEnd | 2017 | `public XYZ LeaderEnd { get ; set ; }` |
| Property | Location | — | `public override Location Location { get ; }` |
| Property | Parameter | — | `` |
| Property | RotationAngle | 2022 | `public double RotationAngle { get ; set ; }` |
| Property | TagHeadPosition | 2017 | `public XYZ TagHeadPosition { get ; set ; }` |
| Property | TagOrientation | 2017 | `public SpatialElementTagOrientation TagOrientation { get ; set ; }` |
| Property | TagText | 2018 | `public string TagText { get ; }` |
| Property | View | — | `public View View { get ; }` |